Revit 2027 API
FaceArray.Append Method
Add the face to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Face item
)
Public Overridable Sub Append (
	item As Face
)
public:
virtual void Append(
	Face^ item
)
abstract Append :
        item : Face -> unit
override Append :
        item : Face -> unit
Parameters
item Face
The face to be added.
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace